#include <REGX52.H>
#include <intrins.H>
#include <Delay.h>
#include <xingshi.h>
 
sbit  D1 = P4^3;  //D1,D2为右边循迹模块                    
sbit  D2 = P3^2; 
sbit  D3 = P3^3;  //D3,D4为左边循迹模块
sbit  D4 = P3^4; 

void xunji()         //高电平检测到，低电平为检测
{
    if(D1==1&&D2==1&&D3==1&&D4==1)  //检测到黑线，无返回
    {
        qianji();
    }
//*****************************************
    
    if(D1==0&&D2==1&&D3==0&&D4==0)   //右边检测到黑线，小车偏左，让车向右移动
    {        
        youzhuan();
            if(D1==0&&D2==0&&D3==0&&D4==0)   //无黑线，检测到白线
            {            
                    qianji();
            }
    }
    
//******************************************
    
    if(D1==0&&D2==0&&D3==1&&D4==0)   //左边检测到黑线，小车偏右，让车向左移动
    {        
        zuozhuan();
            if(D1==0&&D2==0&&D3==0&&D4==0)   //无黑线，检测到白线
            {            
                    qianji();
            }
    }    
    
//***********************************************
    
  if(D1==0&&D2==0&&D3==1&&D4==1)    //左边检测到黑线，直角左拐
    {        
        qianji();
        Delay(50);   //直角左拐前延时50ms
            if(D1==0&&D2==0&&D3==0&&D4==0)   //无黑线，检测到白线
            {            
                    tingzhi();
                    Delay(50);
                  zuozhuan();
            }
    }    
 
//*********************************************
     if(D1==0&&D2==0&&D3==1&&D4==1)   //右边检测到黑线，直角右拐
    {        
        qianji();
        Delay(50);   //直角右拐前延时50ms
            if(D1==0&&D2==0&&D3==0&&D4==0)   //无黑线，检测到白线
            {            
                    tingzhi();
                    Delay(50);
                  youzhuan();
            }
    }    
    
//***************************************************    
}